app/controllers/questions_controller.rb

    def choosegame
        form_answers = params.permit!()
        # byebug
        # [:difficulty, :num_of_questions, :category]
        uri = URI("https://opentdb.com/api.php?amount=#{form_answers["num_of_questions"]}&category=#{form_answers["category"]}&difficulty=#{form_answers["difficulty"]}")

        resp = Net::HTTP.get(uri)

        @questions = JSON.parse(resp)

        @questions["results"].each do |q|

            question = {
                category: q["category"],
                question_type: q["type"],
                difficulty: q["difficulty"],
                question: q["question"],
                correct_answer: q["correct_answer"],
                incorrect_answers: q["incorrect_answers"],
                points: 10
            }

            Question.create(question)
---
INSERT INTO "questions" ("category", "difficulty", "question", "correct_answer", "points", "created_at", "updated_at", "question_type", "incorrect_answers") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)